openFOAM/channelWithStep/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0.5 0)
    (0 0.5 0.05)
    (0.5 0.5 0)
    (0.5 0.5 0.05)
    (0.5 1 0)
    (0.5 1 0.05)
    (0 1 0)
    (0 1 0.05)
    (5 0.5 0)
    (5 0.5 0.05)
    (5 1 0)
    (5 1 0.05)
    (0.5 0 0)
    (0.5 0 0.05)
    (5 0 0)
    (5 0 0.05) 
);

blocks
(
    hex (0 2 4 6 1 3 5 7) (10 10 1) simpleGrading (1 1 1)
    hex (2 8 10 4 3 9 11 5) (90 10 1) simpleGrading (1 1 1)
    hex (12 14 8 2 13 15 9 3) (90 10 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    leftWall
    {
        type wall;
        faces
        (
            (0 1 7 6)
        );
    }
    rightWall
    {
        type wall;
        faces
        (
            (8 9 11 10)
            (14 15 9 8)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 1 3 2)
            (2 3 13 12)
            (12 13 15 14)
            (4 5 7 6)
            (4 5 11 10)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 2 4 6)
            (1 3 5 7)
            (2 8 10 4)
            (3 9 11 5)
            (12 14 8 2)
            (13 15 9 3)
        );
    }
);


// ************************************************************************* //
